In [44]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

En pimera instancia se realizo una exploracio0n de la codificacion del archivo, dado que saltaba error en la codificacion del mismo, e identiificamos que el archivo de encuentra codificado en ISO-8859-1

In [45]:
try:
    df = pd.read_csv("Shark_attacks.csv", encoding="utf-8")
    print("El archivo se leyó con codificación UTF-8.")
except UnicodeDecodeError:
    print("La codificación no es UTF-8. Intentando con ISO-8859-1.")
    try:
        df = pd.read_csv("Shark_attacks.csv", encoding="ISO-8859-1")
        print("El archivo se leyó con codificación ISO-8859-1.")
    except UnicodeDecodeError:
        print("No se pudo leer el archivo. Revisa la codificación.")

La codificación no es UTF-8. Intentando con ISO-8859-1.
El archivo se leyó con codificación ISO-8859-1.

In [46]:
df = pd.read_csv('Shark_attacks.csv', encoding='ISO-8859-1', low_memory=False)

averiguamos el numero total de registros y columnas, generando la dimension total del dataset

In [47]:
print(df.shape)

(25614, 22)

exploramos los registros nulos

In [48]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25614 entries, 0 to 25613
Data columns (total 22 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             6095 non-null   object
 1   Date                    6094 non-null   object
 2   Year                    6092 non-null   float64
 3   Type                    6090 non-null   object
 4   Country                 6048 non-null   object
 5   Area                    5682 non-null   object
 6   Location                5583 non-null   object
 7   Activity                5559 non-null   object
 8   Name                    5888 non-null   object
 9   Sex                     5517 non-null   object
 10  Age                     3374 non-null   object
 11  Injury                  6066 non-null   object
 12  Fatal (Y/N)             6064 non-null   object
 13  Time                    2848 non-null   object
 14  Species                 3100 non-null   object
 15  Investigator or Source  6077 non-null   object
 16  pdf                     6094 non-null   object
 17  href formula            6093 non-null   object
 18  href                    6093 non-null   object
 19  Case Number.1           6094 non-null   object
 20  Case Number.2           6094 non-null   object
 21  original order          6094 non-null   float64
dtypes: float64(2), object(20)
memory usage: 4.3+ MB
None

In [49]:
df.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Fatal (Y/N),Time,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order
0,2017.06.11,2017-06-11,2017.0,Unprovoked,AUSTRALIA,Western Australia,"Point Casuarina, Bunbury",Body boarding,Paul Goff,M,...,N,08h30,"White shark, 4 m","WA Today, 6/11/2017",2017.06.11-Goff.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2017.06.11,2017.06.11,6095.0
1,2017.06.10.b,2017-06-10,2017.0,Unprovoked,AUSTRALIA,Victoria,"Flinders, Mornington Penisula",Surfing,female,F,...,N,15h45,7 gill shark,NaN,2017.06.10.b-Flinders.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2017.06.10.b,2017.06.10.b,6094.0
2,2017.06.10.a,2017-06-10,2017.0,Unprovoked,USA,Florida,"Ponce Inlet, Volusia County",Surfing,Bryan Brock,M,...,N,10h00,NaN,"Daytona Beach News-Journal, 6/10/2017",2017.06.10.a-Brock.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2017.06.10.a,2017.06.10.a,6093.0
3,2017.06.07.R,Reported 07-Jun-2017,2017.0,Unprovoked,UNITED KINGDOM,South Devon,Bantham Beach,Surfing,Rich Thomson,M,...,N,NaN,"3m shark, probably a smooth hound","C. Moore, GSAF",2017.06.07.R-Thomson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2017.06.07.R,2017.06.07.R,6092.0
4,2017.06.04,2017-06-04,2017.0,Unprovoked,USA,Florida,"Middle Sambo Reef off Boca Chica, Monroe County",Spearfishing,Parker Simpson,M,...,N,NaN,8' shark,"Nine News, 6/7/2017",2017.06.04-Simpson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2017.06.04,2017.06.04,6091.0

Buscamos Valores unicos en la columna Case Number para saber si cada caso es distinto

In [50]:
valores_unicos = df["Case Number"].unique()
print(len(valores_unicos))

6080

Como tenemos un total de 6095 registros y 6080 valores son unicos, damos por supuesto que todos los casos son distintos

despues de explorar la tabla, y observar la gran cantidad de valores unicos por columna, decidimos realizar una limpieza de las columnas que no serian utiles en nuestro analisis, quedando unicamente las columnas siguientes:

In [51]:
dflimpio = df[["Year","Type","Country","Sex ","Age","Fatal (Y/N)"]]

In [52]:
dflimpio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25614 entries, 0 to 25613
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         6092 non-null   float64
 1   Type         6090 non-null   object
 2   Country      6048 non-null   object
 3   Sex          5517 non-null   object
 4   Age          3374 non-null   object
 5   Fatal (Y/N)  6064 non-null   object
dtypes: float64(1), object(5)
memory usage: 1.2+ MB

eliminamos los datos nulos

In [53]:
df_clear = dflimpio.dropna()

In [54]:
df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3315 entries, 0 to 6093
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3315 non-null   float64
 1   Type         3315 non-null   object
 2   Country      3315 non-null   object
 3   Sex          3315 non-null   object
 4   Age          3315 non-null   object
 5   Fatal (Y/N)  3315 non-null   object
dtypes: float64(1), object(5)
memory usage: 181.3+ KB

In [55]:
df_clear.head()

     Year        Type         Country Sex  Age Fatal (Y/N)
0  2017.0  Unprovoked       AUSTRALIA    M  48           N
2  2017.0  Unprovoked             USA    M  19           N
3  2017.0  Unprovoked  UNITED KINGDOM    M  30           N
5  2017.0  Unprovoked         BAHAMAS    F  32           N
6  2017.0    Provoked             USA    F  20           N

Vamos a limpiar la columna de la edad.

Convertimos la columna a numerico y los valores no numericos se transforman en NaN

In [56]:

df_clear['Age'] = pd.to_numeric(df_clear['Age'], errors='coerce')

print(df_clear['Age'])
nulos = df_clear["Age"].isna().sum()
print(nulos)

0       48.0
2       19.0
3       30.0
5       32.0
6       20.0
        ...
6035    16.0
6046    50.0
6057     NaN
6068    16.0
6093    15.0
Name: Age, Length: 3315, dtype: float64
94

/tmp/ipykernel_57367/3932975453.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clear['Age'] = pd.to_numeric(df_clear['Age'], errors='coerce')

Dado que son pocos registros los que resultan nulos las edades, comparados con el resto de datos. 

Eliminamos los valores NaN en la columna Age

In [57]:
df_clear = df_clear.dropna(subset=['Age'])

Convertimos el tipo de Dato de la columna Age de float a Int

In [58]:
df_clear['Age'] = df_clear['Age'].astype(int)

In [59]:
df_clear.head()
df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3221 entries, 0 to 6093
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3221 non-null   float64
 1   Type         3221 non-null   object
 2   Country      3221 non-null   object
 3   Sex          3221 non-null   object
 4   Age          3221 non-null   int64
 5   Fatal (Y/N)  3221 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 176.1+ KB

Vamos a limpiar la columna de los años.

Miramos los valores unicos

In [60]:
valores_unicos = df["Year"].unique()
print(valores_unicos)

[2017.   nan 2016. 2015. 2014. 2013. 2012. 2011. 2010. 2009. 2008. 2007.
 2006. 2005. 2004. 2003. 2002. 2001. 2000. 1999. 1998. 1997. 1996. 1995.
 1984. 1994. 1993. 1992. 1991. 1990. 1989. 1969. 1988. 1987. 1986. 1985.
 1983. 1982. 1981. 1980. 1979. 1978. 1977. 1976. 1975. 1974. 1973. 1972.
 1971. 1970. 1968. 1967. 1966. 1965. 1964. 1963. 1962. 1961. 1960. 1959.
 1958. 1957. 1956. 1955. 1954. 1953. 1952. 1951. 1950. 1949. 1948. 1848.
 1947. 1946. 1945. 1944. 1943. 1942. 1941. 1940. 1939. 1938. 1937. 1936.
 1935. 1934. 1933. 1932. 1931. 1930. 1929. 1928. 1927. 1926. 1925. 1924.
 1923. 1922. 1921. 1920. 1919. 1918. 1917. 1916. 1915. 1914. 1913. 1912.
 1911. 1910. 1909. 1908. 1907. 1906. 1905. 1904. 1903. 1902. 1901. 1900.
 1899. 1898. 1897. 1896. 1895. 1894. 1893. 1892. 1891. 1890. 1889. 1888.
 1887. 1886. 1885. 1884. 1883. 1882. 1881. 1880. 1879. 1878. 1877. 1876.
 1875. 1874. 1873. 1872. 1871. 1870. 1869. 1868. 1867. 1866. 1865. 1864.
 1863. 1862. 1861. 1860. 1859. 1858. 1856. 1855. 1854. 1853. 1852. 1851.
 1850. 1849. 1847. 1846. 1845. 1844. 1842. 1841. 1840. 1839. 1837. 1836.
 1835. 1834. 1832. 1831. 1830. 1829. 1828. 1827. 1826. 1825. 1823. 1822.
 1819. 1818. 1817. 1816. 1812. 1811. 1807. 1805. 1804. 1803. 1802. 1800.
 1797. 1791. 1788. 1787. 1786. 1785. 1774. 1779. 1776. 1771. 1767. 1764.
 1758. 1753. 1751. 1749. 1755. 1748. 1742. 1738. 1733. 1721. 1703. 1700.
 1642. 1638. 1637. 1617. 1595. 1580. 1555. 1554. 1543.  500.   77.    5.
    0.]

Limpiamos los registros con fechas NaN y con fechas anteriores o iguales a 500

In [61]:
df_clear = df_clear[df_clear["Year"]>500]

Ahora transformamos el tipo de dato de la columna de float a int

In [62]:
df_clear['Year'] = df_clear['Year'].astype(int)

convertimos el dato int a datetype

In [63]:
df_clear['Year'] = pd.to_datetime(df_clear['Year'], format='%Y', errors='coerce')
df_clear['Year'] = df_clear['Year'].dt.year

como se puede observar, despues de trabajar con la columna Year el tamaño del dataset se ha reducido de 3221 a 3209

In [64]:
df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3209 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3209 non-null   int32
 1   Type         3209 non-null   object
 2   Country      3209 non-null   object
 3   Sex          3209 non-null   object
 4   Age          3209 non-null   int64
 5   Fatal (Y/N)  3209 non-null   object
dtypes: int32(1), int64(1), object(4)
memory usage: 163.0+ KB

Ahora trabajamos con la columns Type.

Sacamos los valores unicos para analizarlos

In [65]:
valores_unicos = df_clear["Type"].unique()
print(valores_unicos)

['Unprovoked' 'Provoked' 'Invalid' 'Boat' 'Sea Disaster' 'Boating']

en esta columna solo se realizo la operacion de cambio de tipo a categoria

In [66]:
df_clear['Type'] = df_clear['Type'].astype('category')

df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3209 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3209 non-null   int32
 1   Type         3209 non-null   category
 2   Country      3209 non-null   object
 3   Sex          3209 non-null   object
 4   Age          3209 non-null   int64
 5   Fatal (Y/N)  3209 non-null   object
dtypes: category(1), int32(1), int64(1), object(3)
memory usage: 141.2+ KB

Ahora pasamos a la columna de Country

In [67]:
valores_unicos = df_clear["Country"].unique()
print(valores_unicos)

['AUSTRALIA' 'USA' 'UNITED KINGDOM' 'BAHAMAS' 'UNITED ARAB EMIRATES'
 'MEXICO' 'SOUTH AFRICA' 'REUNION' 'ST HELENA, British overseas territory'
 'INDONESIA' 'England' 'NEW CALEDONIA' 'SPAIN' 'CHINA' 'JAPAN' 'COLUMBIA'
 'EGYPT' 'NEW ZEALAND' 'FRENCH POLYNESIA' 'CAPE VERDE' 'Fiji' 'BRAZIL'
 'CAYMAN ISLANDS' 'ARUBA' 'ECUADOR' 'MOZAMBIQUE' 'THAILAND' 'PUERTO RICO'
 'ITALY' 'MAURITIUS' 'ST. MARTIN' 'PAPUA NEW GUINEA' 'KIRIBATI' 'ISRAEL'
 'FRANCE' 'DIEGO GARCIA' 'JAMAICA' 'PALESTINIAN TERRITORIES' 'GUAM'
 'SEYCHELLES' 'NIGERIA' 'TONGA' 'SCOTLAND' 'TRINIDAD & TOBAGO' 'CANADA'
 'FIJI' 'SAUDI ARABIA' 'TAIWAN' 'DOMINICAN REPUBLIC' 'KENYA' 'RUSSIA'
 'PHILIPPINES' 'TURKS & CAICOS' 'COSTA RICA' 'UNITED ARAB EMIRATES (UAE)'
 'SAMOA' 'SOLOMON ISLANDS' 'SOUTH KOREA' 'MALTA' 'VIETNAM' 'MADAGASCAR'
 'PANAMA' 'AZORES' 'CUBA' 'CROATIA' 'ENGLAND' 'BRITISH VIRGIN ISLANDS'
 'NORWAY' 'BELIZE' 'ST. MAARTIN' 'GRAND CAYMAN' 'VANUATU' 'SRI LANKA'
 'URUGUAY' 'VENEZUELA' 'INDIA' 'OKINAWA' 'TANZANIA' ' TONGA'
 'MARSHALL ISLANDS' 'SENEGAL' 'HONG KONG' 'CHILE' 'SOMALIA' 'EL SALVADOR'
 'GREECE' 'NORTH ATLANTIC OCEAN' 'PORTUGAL' 'SOUTH CHINA SEA' 'BERMUDA'
 'WESTERN SAMOA' 'PACIFIC OCEAN ' 'BRITISH ISLES' 'MICRONESIA' 'PALAU'
 'GRENADA' 'IRAQ' 'TURKEY' 'SINGAPORE' 'NEW BRITAIN' 'NEW GUINEA'
 'NORTH PACIFIC OCEAN' 'FEDERATED STATES OF MICRONESIA'
 'ADMIRALTY ISLANDS' 'BRITISH WEST INDIES' 'SOUTH ATLANTIC OCEAN'
 'MID ATLANTIC OCEAN' 'JOHNSTON ISLAND' 'NORTH SEA' 'MALDIVE ISLANDS'
 'AMERICAN SAMOA' 'ANDAMAN / NICOBAR ISLANDAS' 'PACIFIC OCEAN'
 'NORTH ATLANTIC OCEAN ' 'ARGENTINA' 'IRAN' 'SIERRA LEONE'
 'CENTRAL PACIFIC' 'ATLANTIC OCEAN' 'BARBADOS' 'FALKLAND ISLANDS'
 'NICARAGUA' 'EGYPT ' 'YEMEN ' 'HAITI' 'BRITISH NEW GUINEA' 'HONDURAS'
 'GUINEA']

Trimamos las strings para eliminar los espacios y convertimos a mayusculas para homogeneizar los registros

In [68]:
# Convert all values in the 'Country' column to uppercase and remove leading/trailing whitespace
df_clear['Country'] = df_clear['Country'].str.upper().str.strip()

# Display unique values to confirm the changes
valores_unicos = df_clear['Country'].unique()
print(valores_unicos)

['AUSTRALIA' 'USA' 'UNITED KINGDOM' 'BAHAMAS' 'UNITED ARAB EMIRATES'
 'MEXICO' 'SOUTH AFRICA' 'REUNION' 'ST HELENA, BRITISH OVERSEAS TERRITORY'
 'INDONESIA' 'ENGLAND' 'NEW CALEDONIA' 'SPAIN' 'CHINA' 'JAPAN' 'COLUMBIA'
 'EGYPT' 'NEW ZEALAND' 'FRENCH POLYNESIA' 'CAPE VERDE' 'FIJI' 'BRAZIL'
 'CAYMAN ISLANDS' 'ARUBA' 'ECUADOR' 'MOZAMBIQUE' 'THAILAND' 'PUERTO RICO'
 'ITALY' 'MAURITIUS' 'ST. MARTIN' 'PAPUA NEW GUINEA' 'KIRIBATI' 'ISRAEL'
 'FRANCE' 'DIEGO GARCIA' 'JAMAICA' 'PALESTINIAN TERRITORIES' 'GUAM'
 'SEYCHELLES' 'NIGERIA' 'TONGA' 'SCOTLAND' 'TRINIDAD & TOBAGO' 'CANADA'
 'SAUDI ARABIA' 'TAIWAN' 'DOMINICAN REPUBLIC' 'KENYA' 'RUSSIA'
 'PHILIPPINES' 'TURKS & CAICOS' 'COSTA RICA' 'UNITED ARAB EMIRATES (UAE)'
 'SAMOA' 'SOLOMON ISLANDS' 'SOUTH KOREA' 'MALTA' 'VIETNAM' 'MADAGASCAR'
 'PANAMA' 'AZORES' 'CUBA' 'CROATIA' 'BRITISH VIRGIN ISLANDS' 'NORWAY'
 'BELIZE' 'ST. MAARTIN' 'GRAND CAYMAN' 'VANUATU' 'SRI LANKA' 'URUGUAY'
 'VENEZUELA' 'INDIA' 'OKINAWA' 'TANZANIA' 'MARSHALL ISLANDS' 'SENEGAL'
 'HONG KONG' 'CHILE' 'SOMALIA' 'EL SALVADOR' 'GREECE'
 'NORTH ATLANTIC OCEAN' 'PORTUGAL' 'SOUTH CHINA SEA' 'BERMUDA'
 'WESTERN SAMOA' 'PACIFIC OCEAN' 'BRITISH ISLES' 'MICRONESIA' 'PALAU'
 'GRENADA' 'IRAQ' 'TURKEY' 'SINGAPORE' 'NEW BRITAIN' 'NEW GUINEA'
 'NORTH PACIFIC OCEAN' 'FEDERATED STATES OF MICRONESIA'
 'ADMIRALTY ISLANDS' 'BRITISH WEST INDIES' 'SOUTH ATLANTIC OCEAN'
 'MID ATLANTIC OCEAN' 'JOHNSTON ISLAND' 'NORTH SEA' 'MALDIVE ISLANDS'
 'AMERICAN SAMOA' 'ANDAMAN / NICOBAR ISLANDAS' 'ARGENTINA' 'IRAN'
 'SIERRA LEONE' 'CENTRAL PACIFIC' 'ATLANTIC OCEAN' 'BARBADOS'
 'FALKLAND ISLANDS' 'NICARAGUA' 'YEMEN' 'HAITI' 'BRITISH NEW GUINEA'
 'HONDURAS' 'GUINEA']

In [69]:
df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3209 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3209 non-null   int32
 1   Type         3209 non-null   category
 2   Country      3209 non-null   object
 3   Sex          3209 non-null   object
 4   Age          3209 non-null   int64
 5   Fatal (Y/N)  3209 non-null   object
dtypes: category(1), int32(1), int64(1), object(3)
memory usage: 141.2+ KB

Seguidamente trabajamos la columna Sex

se modifica el nombre de la columna porque contenia errores de sintaxis

In [70]:
df_clear["Sex"] = df_clear["Sex "]

df_clear = df_clear.drop("Sex ", axis=1)
df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3209 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3209 non-null   int32
 1   Type         3209 non-null   category
 2   Country      3209 non-null   object
 3   Age          3209 non-null   int64
 4   Fatal (Y/N)  3209 non-null   object
 5   Sex          3209 non-null   object
dtypes: category(1), int32(1), int64(1), object(3)
memory usage: 141.2+ KB

In [71]:
valores_unicos = df_clear["Sex"].unique()
print(valores_unicos)

['M' 'F' 'M ' 'lli']

detectamos que hay mas tipos de generos de los esperados.

procedemos a reparar el genero masculino que presentra dos estados "M" y "M "

In [72]:
df_clear.loc[df_clear["Sex"]=="M ", "Sex"]= "M"
valores_unicos = df_clear["Sex"].unique()
print(valores_unicos)

['M' 'F' 'lli']

In [73]:
cuantos_lli =(df_clear["Sex"] == "lli").sum()
print(cuantos_lli)

1

Como solo hay un lli vamos a ver si es Hombre o mujer

In [74]:
mis_lli = df[df["Sex "]=="lli"]
mis_lli

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Fatal (Y/N),Time,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order
1484,2004.11.11.b,2004-11-11,2004.0,Unprovoked,USA,California,"Bunkers, Humboldt Bay, Eureka, Humboldt County",Surfing,Brian Kang,lli,...,N,13h30,5.5 m [18'] white shark,"R. Collier, GSAF",2004.11.11.b-Kang.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2004.11.11.b,2004.11.11.b,4611.0

como podemos observar es un hombre por lo tanto se le asignará el valor "M"

In [75]:
df_clear.loc[df_clear["Sex"]=="lli", "Sex"]= "M"

In [76]:
valores_unicos = df_clear["Sex"].unique()
print(valores_unicos)

['M' 'F']

Cambiamos el tipo de dato de la columna Sex de objeto a categoria

In [77]:
df_clear['Sex'] = df_clear['Sex'].astype('category')
df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3209 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3209 non-null   int32
 1   Type         3209 non-null   category
 2   Country      3209 non-null   object
 3   Age          3209 non-null   int64
 4   Fatal (Y/N)  3209 non-null   object
 5   Sex          3209 non-null   category
dtypes: category(2), int32(1), int64(1), object(2)
memory usage: 119.4+ KB

In [78]:
valores_unicos = df_clear["Fatal (Y/N)"].unique()
print(valores_unicos)

['N' 'Y' '2017' 'UNKNOWN' ' N']

cambiamos los valores de " N" a "N"

In [79]:
df_clear.loc[df_clear["Fatal (Y/N)"]==" N", "Fatal (Y/N)"]= "N"
valores_unicos = df_clear["Fatal (Y/N)"].unique()
print(valores_unicos)

['N' 'Y' '2017' 'UNKNOWN']

In [80]:
cuantos_2017 =(df_clear["Fatal (Y/N)"] == "2017").sum()
print(cuantos_2017)

cuantos_uknown =(df_clear["Fatal (Y/N)"] == "UNKNOWN").sum()
print(cuantos_uknown)

1
9

dada la marginalidad de los datos de Unknown y 2017 decidimos elimiar dichos registros

In [81]:
indiceseliminar = df_clear[(df_clear["Fatal (Y/N)"] == "2017") | (df_clear["Fatal (Y/N)"] == "UNKNOWN")].index

df_clear = df_clear.drop(indiceseliminar)

In [82]:
valores_unicos = df_clear["Fatal (Y/N)"].unique()
print(valores_unicos)

['N' 'Y']

Vamos a convertir la columna Fatal de objeto a Bool

In [83]:
df_clear['Fatal (Y/N)'] = df_clear['Fatal (Y/N)'].replace({"Y": True, "N": False})

df_clear.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3199 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3199 non-null   int32
 1   Type         3199 non-null   category
 2   Country      3199 non-null   object
 3   Age          3199 non-null   int64
 4   Fatal (Y/N)  3199 non-null   bool
 5   Sex          3199 non-null   category
dtypes: bool(1), category(2), int32(1), int64(1), object(1)
memory usage: 97.2+ KB

/tmp/ipykernel_57367/1774482131.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_clear['Fatal (Y/N)'] = df_clear['Fatal (Y/N)'].replace({"Y": True, "N": False})

Ahora vamos a comprobar si existen valores duplicados

In [84]:
duplicates = df_clear.duplicated().sum()
print(f"\nNumber of duplicate rows: {duplicates}")

Number of duplicate rows: 266

eliminamos los duplicados y obtenemos nuestro dataframe final listo para el analisis

In [85]:

df_finish = df_clear.drop_duplicates()

print("\nDuplicates Removed.")
df_finish.info()

Duplicates Removed.
<class 'pandas.core.frame.DataFrame'>
Index: 2933 entries, 0 to 5953
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         2933 non-null   int32
 1   Type         2933 non-null   category
 2   Country      2933 non-null   object
 3   Age          2933 non-null   int64
 4   Fatal (Y/N)  2933 non-null   bool
 5   Sex          2933 non-null   category
dtypes: bool(1), category(2), int32(1), int64(1), object(1)
memory usage: 89.1+ KB

In [88]:
# Save with a custom delimiter and exclude index
df_finish.to_csv('Shark_finish.csv', index=False, header=True)